2.2.013/src/Catalogs/МК_ОсобыеНачисленияУдержания/МК_ОсобыеНачисленияУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ОсобыеНачисленияУдержания</name>
  <attributes>
    <name>ВидЗаписи</name>
    <comment>1 - начисление, 2 - удержание</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыОсобыхНачисленийИУдержаний</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ОсобыеНачисленияУдержания/ManagerModule.bsl
// В этом справочнике хранятся особые виды начислений и удержаний ЗУП. Их нужно выгружать в МояКоманда в составе
// справочников (планов вида расчетов), но у них нет UIDа. Поэтому здесь значениям перечисления присваивается  
// уникальный идентификатор. Это собственно идентификатор записи справочника. Кроме того, тут определяется, что
// это за величина - начисление или удержание. В перечислении такого реквизита нет. 1С конечно знает это, но я - нет.
// Передаются два параметра: мВидРасчета - значение перечисления, которое нужно найти. Если находим, возвращаем
// идентификатор записи справочника. Если не находим, добавляем новый элемент, в который прописывается кроме значения
// перечисления - мВид (1 - начисление, 2 - удержание).

Функция МК_ДобавитьВернутьОсобое(мВидРасчета,мВид)  Экспорт   
	мРез = Неопределено;
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1	               
				   |    МК_ОНУ.Ссылка КАК Ссылка				   
	               |ИЗ
	               |	Справочник.МК_ОсобыеНачисленияУдержания КАК МК_ОНУ
	  	           |ГДЕ
		           |	МК_ОНУ.ВидРасчета = &мВидРасчета"				   
				   ;
		
	мЗапрос.УстановитьПараметр("мВидРасчета",мВидРасчета);
			
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();    
	Если Выборка.Следующий() Тогда
		мРез = Выборка.Ссылка.УникальныйИдентификатор();		
	КонецЕсли; 
	Если мРез = Неопределено Тогда  // Не нашли. Надо добавить
		мНЭ = Справочники.МК_ОсобыеНачисленияУдержания.СоздатьЭлемент();				
		мНЭ.Наименование = Строка(мВидРасчета);
		мНЭ.ВидЗаписи = мВид;
		мНЭ.ВидРасчета = мВидРасчета;   
		мНЭ.Записать();
		мРез = мНЭ.Ссылка.УникальныйИдентификатор();
	КонецЕсли;	
	
	Возврат мРез;	
КонецФункции	   

Функция МК_ВсеОсобыеНУ()  Экспорт   
	мВозврат = Новый Массив;
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ	               
				   |    МК_ОНУ.Ссылка КАК Ссылка,				   
				   |	МК_ОНУ.ВидЗаписи Как Вид
	               |ИЗ
	               |	Справочник.МК_ОсобыеНачисленияУдержания КАК МК_ОНУ"
	  	           //|ГДЕ
		           //|	МК_ОНУ.ВидРасчета = &мВидРасчета"				   
				   ;
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();    
	Пока Выборка.Следующий() Цикл
		мСтр = Новый Структура;
		мСтр.Вставить("УИД", СокрЛП(Выборка.Ссылка.УникальныйИдентификатор()));
		мСтр.Вставить("Вид",Выборка.Вид); 
		мСтр.Вставить("Имя",Выборка.Ссылка.Наименование);
		мВозврат.Добавить(мСтр);
	КонецЦикла; 
	Возврат мВозврат;	
КонецФункции
